GopalSaraf/Practicals/PSDL/include/proc/pic16c765.inc
// Register: TRISD
#define TRISD TRISD
TRISD                                    equ 0088h
// bitfield definitions
TRISD_TRISD0_POSN                        equ 0000h
TRISD_TRISD0_POSITION                    equ 0000h
TRISD_TRISD0_SIZE                        equ 0001h
TRISD_TRISD0_LENGTH                      equ 0001h
TRISD_TRISD0_MASK                        equ 0001h
TRISD_TRISD1_POSN                        equ 0001h
TRISD_TRISD1_POSITION                    equ 0001h
TRISD_TRISD1_SIZE                        equ 0001h
TRISD_TRISD1_LENGTH                      equ 0001h
TRISD_TRISD1_MASK                        equ 0002h
TRISD_TRISD2_POSN                        equ 0002h
TRISD_TRISD2_POSITION                    equ 0002h
TRISD_TRISD2_SIZE                        equ 0001h
TRISD_TRISD2_LENGTH                      equ 0001h
TRISD_TRISD2_MASK                        equ 0004h
TRISD_TRISD3_POSN                        equ 0003h
TRISD_TRISD3_POSITION                    equ 0003h
TRISD_TRISD3_SIZE                        equ 0001h
TRISD_TRISD3_LENGTH                      equ 0001h
TRISD_TRISD3_MASK                        equ 0008h
TRISD_TRISD4_POSN                        equ 0004h
TRISD_TRISD4_POSITION                    equ 0004h
TRISD_TRISD4_SIZE                        equ 0001h
TRISD_TRISD4_LENGTH                      equ 0001h
TRISD_TRISD4_MASK                        equ 0010h
TRISD_TRISD5_POSN                        equ 0005h
TRISD_TRISD5_POSITION                    equ 0005h
TRISD_TRISD5_SIZE                        equ 0001h
TRISD_TRISD5_LENGTH                      equ 0001h
TRISD_TRISD5_MASK                        equ 0020h
TRISD_TRISD6_POSN                        equ 0006h
TRISD_TRISD6_POSITION                    equ 0006h
TRISD_TRISD6_SIZE                        equ 0001h
TRISD_TRISD6_LENGTH                      equ 0001h
TRISD_TRISD6_MASK                        equ 0040h
TRISD_TRISD7_POSN                        equ 0007h
TRISD_TRISD7_POSITION                    equ 0007h
TRISD_TRISD7_SIZE                        equ 0001h
TRISD_TRISD7_LENGTH                      equ 0001h
TRISD_TRISD7_MASK                        equ 0080h

// Register: TRISE
#define TRISE TRISE
TRISE                                    equ 0089h
// bitfield definitions
TRISE_TRISE0_POSN                        equ 0000h
TRISE_TRISE0_POSITION                    equ 0000h
TRISE_TRISE0_SIZE                        equ 0001h
TRISE_TRISE0_LENGTH                      equ 0001h
TRISE_TRISE0_MASK                        equ 0001h
TRISE_TRISE1_POSN                        equ 0001h
TRISE_TRISE1_POSITION                    equ 0001h
TRISE_TRISE1_SIZE                        equ 0001h
TRISE_TRISE1_LENGTH                      equ 0001h
TRISE_TRISE1_MASK                        equ 0002h
TRISE_TRISE2_POSN                        equ 0002h
TRISE_TRISE2_POSITION                    equ 0002h
TRISE_TRISE2_SIZE                        equ 0001h
TRISE_TRISE2_LENGTH                      equ 0001h
TRISE_TRISE2_MASK                        equ 0004h
TRISE_PSPMODE_POSN                       equ 0004h
TRISE_PSPMODE_POSITION                   equ 0004h
TRISE_PSPMODE_SIZE                       equ 0001h
TRISE_PSPMODE_LENGTH                     equ 0001h
TRISE_PSPMODE_MASK                       equ 0010h
TRISE_IBOV_POSN                          equ 0005h
TRISE_IBOV_POSITION                      equ 0005h
TRISE_IBOV_SIZE                          equ 0001h
TRISE_IBOV_LENGTH                        equ 0001h
TRISE_IBOV_MASK                          equ 0020h
TRISE_OBF_POSN                           equ 0006h
TRISE_OBF_POSITION                       equ 0006h
TRISE_OBF_SIZE                           equ 0001h
TRISE_OBF_LENGTH                         equ 0001h
TRISE_OBF_MASK                           equ 0040h
TRISE_IBF_POSN                           equ 0007h
TRISE_IBF_POSITION                       equ 0007h
TRISE_IBF_SIZE                           equ 0001h
TRISE_IBF_LENGTH                         equ 0001h
TRISE_IBF_MASK                           equ 0080h

// Register: PIE1
#define PIE1 PIE1
PIE1                                     equ 008Ch
// bitfield definitions
PIE1_TMR1IE_POSN                         equ 0000h
PIE1_TMR1IE_POSITION                     equ 0000h
PIE1_TMR1IE_SIZE                         equ 0001h
PIE1_TMR1IE_LENGTH                       equ 0001h
PIE1_TMR1IE_MASK                         equ 0001h
PIE1_TMR2IE_POSN                         equ 0001h
PIE1_TMR2IE_POSITION                     equ 0001h
PIE1_TMR2IE_SIZE                         equ 0001h
PIE1_TMR2IE_LENGTH                       equ 0001h
PIE1_TMR2IE_MASK                         equ 0002h
PIE1_CCP1IE_POSN                         equ 0002h
PIE1_CCP1IE_POSITION                     equ 0002h
PIE1_CCP1IE_SIZE                         equ 0001h
PIE1_CCP1IE_LENGTH                       equ 0001h
PIE1_CCP1IE_MASK                         equ 0004h
PIE1_USBIE_POSN                          equ 0003h
PIE1_USBIE_POSITION                      equ 0003h
PIE1_USBIE_SIZE                          equ 0001h
PIE1_USBIE_LENGTH                        equ 0001h
PIE1_USBIE_MASK                          equ 0008h
PIE1_TXIE_POSN                           equ 0004h
PIE1_TXIE_POSITION                       equ 0004h
PIE1_TXIE_SIZE                           equ 0001h
PIE1_TXIE_LENGTH                         equ 0001h
PIE1_TXIE_MASK                           equ 0010h
PIE1_RCIE_POSN                           equ 0005h
PIE1_RCIE_POSITION                       equ 0005h
PIE1_RCIE_SIZE                           equ 0001h
PIE1_RCIE_LENGTH                         equ 0001h
PIE1_RCIE_MASK                           equ 0020h
PIE1_ADIE_POSN                           equ 0006h
PIE1_ADIE_POSITION                       equ 0006h
PIE1_ADIE_SIZE                           equ 0001h
PIE1_ADIE_LENGTH                         equ 0001h
PIE1_ADIE_MASK                           equ 0040h
PIE1_PSPIE_POSN                          equ 0007h
PIE1_PSPIE_POSITION                      equ 0007h
PIE1_PSPIE_SIZE                          equ 0001h
PIE1_PSPIE_LENGTH                        equ 0001h
PIE1_PSPIE_MASK                          equ 0080h

// Register: PIE2
#define PIE2 PIE2
PIE2                                     equ 008Dh
// bitfield definitions
PIE2_CCP2IE_POSN                         equ 0000h
PIE2_CCP2IE_POSITION                     equ 0000h
PIE2_CCP2IE_SIZE                         equ 0001h
PIE2_CCP2IE_LENGTH                       equ 0001h
PIE2_CCP2IE_MASK                         equ 0001h

// Register: PCON
#define PCON PCON
PCON                                     equ 008Eh
// bitfield definitions
PCON_nBOR_POSN                           equ 0000h
PCON_nBOR_POSITION                       equ 0000h
PCON_nBOR_SIZE                           equ 0001h
PCON_nBOR_LENGTH                         equ 0001h
PCON_nBOR_MASK                           equ 0001h
PCON_nPOR_POSN                           equ 0001h
PCON_nPOR_POSITION                       equ 0001h
PCON_nPOR_SIZE                           equ 0001h
PCON_nPOR_LENGTH                         equ 0001h
PCON_nPOR_MASK                           equ 0002h
PCON_nBO_POSN                            equ 0000h
PCON_nBO_POSITION                        equ 0000h
PCON_nBO_SIZE                            equ 0001h
PCON_nBO_LENGTH                          equ 0001h
PCON_nBO_MASK                            equ 0001h

// Register: PR2
#define PR2 PR2
PR2                                      equ 0092h
// bitfield definitions
PR2_PR2_POSN                             equ 0000h
PR2_PR2_POSITION                         equ 0000h
PR2_PR2_SIZE                             equ 0008h
PR2_PR2_LENGTH                           equ 0008h
PR2_PR2_MASK                             equ 00FFh

// Register: TXSTA
#define TXSTA TXSTA
TXSTA                                    equ 0098h
// bitfield definitions
TXSTA_TX9D_POSN                          equ 0000h
TXSTA_TX9D_POSITION                      equ 0000h
TXSTA_TX9D_SIZE                          equ 0001h
TXSTA_TX9D_LENGTH                        equ 0001h
TXSTA_TX9D_MASK                          equ 0001h
TXSTA_TRMT_POSN                          equ 0001h
TXSTA_TRMT_POSITION                      equ 0001h
TXSTA_TRMT_SIZE                          equ 0001h
TXSTA_TRMT_LENGTH                        equ 0001h
TXSTA_TRMT_MASK                          equ 0002h
TXSTA_BRGH_POSN                          equ 0002h
TXSTA_BRGH_POSITION                      equ 0002h
TXSTA_BRGH_SIZE                          equ 0001h
TXSTA_BRGH_LENGTH                        equ 0001h
TXSTA_BRGH_MASK                          equ 0004h
TXSTA_SYNC_POSN                          equ 0004h
TXSTA_SYNC_POSITION                      equ 0004h
TXSTA_SYNC_SIZE                          equ 0001h
TXSTA_SYNC_LENGTH                        equ 0001h
TXSTA_SYNC_MASK                          equ 0010h
TXSTA_TXEN_POSN                          equ 0005h
TXSTA_TXEN_POSITION                      equ 0005h
TXSTA_TXEN_SIZE                          equ 0001h
TXSTA_TXEN_LENGTH                        equ 0001h
TXSTA_TXEN_MASK                          equ 0020h
TXSTA_TX9_POSN                           equ 0006h
TXSTA_TX9_POSITION                       equ 0006h
TXSTA_TX9_SIZE                           equ 0001h
TXSTA_TX9_LENGTH                         equ 0001h
TXSTA_TX9_MASK                           equ 0040h
TXSTA_CSRC_POSN                          equ 0007h
TXSTA_CSRC_POSITION                      equ 0007h
TXSTA_CSRC_SIZE                          equ 0001h
TXSTA_CSRC_LENGTH                        equ 0001h
TXSTA_CSRC_MASK                          equ 0080h
TXSTA_TXD8_POSN                          equ 0000h
TXSTA_TXD8_POSITION                      equ 0000h
TXSTA_TXD8_SIZE                          equ 0001h
TXSTA_TXD8_LENGTH                        equ 0001h
TXSTA_TXD8_MASK                          equ 0001h
TXSTA_nTX8_POSN                          equ 0006h
TXSTA_nTX8_POSITION                      equ 0006h
TXSTA_nTX8_SIZE                          equ 0001h
TXSTA_nTX8_LENGTH                        equ 0001h
TXSTA_nTX8_MASK                          equ 0040h
TXSTA_TX8_9_POSN                         equ 0006h
TXSTA_TX8_9_POSITION                     equ 0006h
TXSTA_TX8_9_SIZE                         equ 0001h
TXSTA_TX8_9_LENGTH                       equ 0001h
TXSTA_TX8_9_MASK                         equ 0040h

// Register: SPBRG
#define SPBRG SPBRG
SPBRG                                    equ 0099h

// Register: ADCON1
#define ADCON1 ADCON1
ADCON1                                   equ 009Fh
// bitfield definitions
ADCON1_PCFG_POSN                         equ 0000h
ADCON1_PCFG_POSITION                     equ 0000h
ADCON1_PCFG_SIZE                         equ 0003h
ADCON1_PCFG_LENGTH                       equ 0003h
ADCON1_PCFG_MASK                         equ 0007h
ADCON1_PCFG0_POSN                        equ 0000h
ADCON1_PCFG0_POSITION                    equ 0000h
ADCON1_PCFG0_SIZE                        equ 0001h
ADCON1_PCFG0_LENGTH                      equ 0001h
ADCON1_PCFG0_MASK                        equ 0001h
ADCON1_PCFG1_POSN                        equ 0001h
ADCON1_PCFG1_POSITION                    equ 0001h
ADCON1_PCFG1_SIZE                        equ 0001h
ADCON1_PCFG1_LENGTH                      equ 0001h
ADCON1_PCFG1_MASK                        equ 0002h
ADCON1_PCFG2_POSN                        equ 0002h
ADCON1_PCFG2_POSITION                    equ 0002h
ADCON1_PCFG2_SIZE                        equ 0001h
ADCON1_PCFG2_LENGTH                      equ 0001h
ADCON1_PCFG2_MASK                        equ 0004h

// Register: UIR
#define UIR UIR
UIR                                      equ 0190h
// bitfield definitions
UIR_USB_RST_POSN                         equ 0000h
UIR_USB_RST_POSITION                     equ 0000h
UIR_USB_RST_SIZE                         equ 0001h
UIR_USB_RST_LENGTH                       equ 0001h
UIR_USB_RST_MASK                         equ 0001h
UIR_UERR_POSN                            equ 0001h
UIR_UERR_POSITION                        equ 0001h
UIR_UERR_SIZE                            equ 0001h
UIR_UERR_LENGTH                          equ 0001h
UIR_UERR_MASK                            equ 0002h
UIR_ACTIVITY_POSN                        equ 0002h
UIR_ACTIVITY_POSITION                    equ 0002h
UIR_ACTIVITY_SIZE                        equ 0001h
UIR_ACTIVITY_LENGTH                      equ 0001h
UIR_ACTIVITY_MASK                        equ 0004h
UIR_TOK_DNE_POSN                         equ 0003h
UIR_TOK_DNE_POSITION                     equ 0003h
UIR_TOK_DNE_SIZE                         equ 0001h
UIR_TOK_DNE_LENGTH                       equ 0001h
UIR_TOK_DNE_MASK                         equ 0008h
UIR_UIDLE_POSN                           equ 0004h
UIR_UIDLE_POSITION                       equ 0004h
UIR_UIDLE_SIZE                           equ 0001h
UIR_UIDLE_LENGTH                         equ 0001h
UIR_UIDLE_MASK                           equ 0010h
UIR_STALL_POSN                           equ 0005h
UIR_STALL_POSITION                       equ 0005h
UIR_STALL_SIZE                           equ 0001h
UIR_STALL_LENGTH                         equ 0001h
UIR_STALL_MASK                           equ 0020h

// Register: UIE
#define UIE UIE
UIE                                      equ 0191h
// bitfield definitions
UIE_USB_RST_POSN                         equ 0000h
UIE_USB_RST_POSITION                     equ 0000h
UIE_USB_RST_SIZE                         equ 0001h
UIE_USB_RST_LENGTH                       equ 0001h
UIE_USB_RST_MASK                         equ 0001h
UIE_UERR_POSN                            equ 0001h
UIE_UERR_POSITION                        equ 0001h
UIE_UERR_SIZE                            equ 0001h
UIE_UERR_LENGTH                          equ 0001h
UIE_UERR_MASK                            equ 0002h
UIE_ACTIVITY_POSN                        equ 0002h
UIE_ACTIVITY_POSITION                    equ 0002h
UIE_ACTIVITY_SIZE                        equ 0001h
UIE_ACTIVITY_LENGTH                      equ 0001h
UIE_ACTIVITY_MASK                        equ 0004h
UIE_TOK_DNE_POSN                         equ 0003h
UIE_TOK_DNE_POSITION                     equ 0003h
UIE_TOK_DNE_SIZE                         equ 0001h
UIE_TOK_DNE_LENGTH                       equ 0001h
UIE_TOK_DNE_MASK                         equ 0008h
UIE_UIDLE_POSN                           equ 0004h
UIE_UIDLE_POSITION                       equ 0004h
UIE_UIDLE_SIZE                           equ 0001h
UIE_UIDLE_LENGTH                         equ 0001h
UIE_UIDLE_MASK                           equ 0010h
UIE_STALL_POSN                           equ 0005h
UIE_STALL_POSITION                       equ 0005h
UIE_STALL_SIZE                           equ 0001h
UIE_STALL_LENGTH                         equ 0001h
UIE_STALL_MASK                           equ 0020h

// Register: UEIR
#define UEIR UEIR
UEIR                                     equ 0192h
// bitfield definitions
UEIR_PID_ERR_POSN                        equ 0000h
UEIR_PID_ERR_POSITION                    equ 0000h
UEIR_PID_ERR_SIZE                        equ 0001h
UEIR_PID_ERR_LENGTH                      equ 0001h
UEIR_PID_ERR_MASK                        equ 0001h
UEIR_CRC5_POSN                           equ 0001h
UEIR_CRC5_POSITION                       equ 0001h
UEIR_CRC5_SIZE                           equ 0001h
UEIR_CRC5_LENGTH                         equ 0001h
UEIR_CRC5_MASK                           equ 0002h
UEIR_CRC16_POSN                          equ 0002h
UEIR_CRC16_POSITION                      equ 0002h
UEIR_CRC16_SIZE                          equ 0001h
UEIR_CRC16_LENGTH                        equ 0001h
UEIR_CRC16_MASK                          equ 0004h
UEIR_DFN8_POSN                           equ 0003h
UEIR_DFN8_POSITION                       equ 0003h
UEIR_DFN8_SIZE                           equ 0001h
UEIR_DFN8_LENGTH                         equ 0001h
UEIR_DFN8_MASK                           equ 0008h
UEIR_BTO_ERR_POSN                        equ 0004h
UEIR_BTO_ERR_POSITION                    equ 0004h
UEIR_BTO_ERR_SIZE                        equ 0001h
UEIR_BTO_ERR_LENGTH                      equ 0001h
UEIR_BTO_ERR_MASK                        equ 0010h
UEIR_WRT_ERR_POSN                        equ 0005h
UEIR_WRT_ERR_POSITION                    equ 0005h
UEIR_WRT_ERR_SIZE                        equ 0001h
UEIR_WRT_ERR_LENGTH                      equ 0001h
UEIR_WRT_ERR_MASK                        equ 0020h
UEIR_OWN_ERR_POSN                        equ 0006h
UEIR_OWN_ERR_POSITION                    equ 0006h
UEIR_OWN_ERR_SIZE                        equ 0001h
UEIR_OWN_ERR_LENGTH                      equ 0001h
UEIR_OWN_ERR_MASK                        equ 0040h
UEIR_BTS_ERR_POSN                        equ 0007h
UEIR_BTS_ERR_POSITION                    equ 0007h
UEIR_BTS_ERR_SIZE                        equ 0001h
UEIR_BTS_ERR_LENGTH                      equ 0001h
UEIR_BTS_ERR_MASK                        equ 0080h

