GopalSaraf/Practicals/PSDL/include/proc/pic16c765.inc
// Register: BD0OST
#define BD0OST BD0OST
BD0OST                                   equ 01A0h
// bitfield definitions
BD0OST_PID0_BSTALL_POSN                  equ 0002h
BD0OST_PID0_BSTALL_POSITION              equ 0002h
BD0OST_PID0_BSTALL_SIZE                  equ 0001h
BD0OST_PID0_BSTALL_LENGTH                equ 0001h
BD0OST_PID0_BSTALL_MASK                  equ 0004h
BD0OST_PID1_DTS_POSN                     equ 0003h
BD0OST_PID1_DTS_POSITION                 equ 0003h
BD0OST_PID1_DTS_SIZE                     equ 0001h
BD0OST_PID1_DTS_LENGTH                   equ 0001h
BD0OST_PID1_DTS_MASK                     equ 0008h
BD0OST_PID2_POSN                         equ 0004h
BD0OST_PID2_POSITION                     equ 0004h
BD0OST_PID2_SIZE                         equ 0001h
BD0OST_PID2_LENGTH                       equ 0001h
BD0OST_PID2_MASK                         equ 0010h
BD0OST_PID3_POSN                         equ 0005h
BD0OST_PID3_POSITION                     equ 0005h
BD0OST_PID3_SIZE                         equ 0001h
BD0OST_PID3_LENGTH                       equ 0001h
BD0OST_PID3_MASK                         equ 0020h
BD0OST_DATA0_1_POSN                      equ 0006h
BD0OST_DATA0_1_POSITION                  equ 0006h
BD0OST_DATA0_1_SIZE                      equ 0001h
BD0OST_DATA0_1_LENGTH                    equ 0001h
BD0OST_DATA0_1_MASK                      equ 0040h
BD0OST_UOWN_POSN                         equ 0007h
BD0OST_UOWN_POSITION                     equ 0007h
BD0OST_UOWN_SIZE                         equ 0001h
BD0OST_UOWN_LENGTH                       equ 0001h
BD0OST_UOWN_MASK                         equ 0080h
BD0OST_PID0_POSN                         equ 0002h
BD0OST_PID0_POSITION                     equ 0002h
BD0OST_PID0_SIZE                         equ 0001h
BD0OST_PID0_LENGTH                       equ 0001h
BD0OST_PID0_MASK                         equ 0004h
BD0OST_PID1_POSN                         equ 0003h
BD0OST_PID1_POSITION                     equ 0003h
BD0OST_PID1_SIZE                         equ 0001h
BD0OST_PID1_LENGTH                       equ 0001h
BD0OST_PID1_MASK                         equ 0008h
BD0OST_DATA01_POSN                       equ 0006h
BD0OST_DATA01_POSITION                   equ 0006h
BD0OST_DATA01_SIZE                       equ 0001h
BD0OST_DATA01_LENGTH                     equ 0001h
BD0OST_DATA01_MASK                       equ 0040h
BD0OST_OWN_POSN                          equ 0007h
BD0OST_OWN_POSITION                      equ 0007h
BD0OST_OWN_SIZE                          equ 0001h
BD0OST_OWN_LENGTH                        equ 0001h
BD0OST_OWN_MASK                          equ 0080h
BD0OST_BSTALL_POSN                       equ 0002h
BD0OST_BSTALL_POSITION                   equ 0002h
BD0OST_BSTALL_SIZE                       equ 0001h
BD0OST_BSTALL_LENGTH                     equ 0001h
BD0OST_BSTALL_MASK                       equ 0004h
BD0OST_DTS_POSN                          equ 0003h
BD0OST_DTS_POSITION                      equ 0003h
BD0OST_DTS_SIZE                          equ 0001h
BD0OST_DTS_LENGTH                        equ 0001h
BD0OST_DTS_MASK                          equ 0008h

// Register: BD0OBC
#define BD0OBC BD0OBC
BD0OBC                                   equ 01A1h
// bitfield definitions
BD0OBC_BC_POSN                           equ 0000h
BD0OBC_BC_POSITION                       equ 0000h
BD0OBC_BC_SIZE                           equ 0004h
BD0OBC_BC_LENGTH                         equ 0004h
BD0OBC_BC_MASK                           equ 000Fh
BD0OBC_BC0_POSN                          equ 0000h
BD0OBC_BC0_POSITION                      equ 0000h
BD0OBC_BC0_SIZE                          equ 0001h
BD0OBC_BC0_LENGTH                        equ 0001h
BD0OBC_BC0_MASK                          equ 0001h
BD0OBC_BC1_POSN                          equ 0001h
BD0OBC_BC1_POSITION                      equ 0001h
BD0OBC_BC1_SIZE                          equ 0001h
BD0OBC_BC1_LENGTH                        equ 0001h
BD0OBC_BC1_MASK                          equ 0002h
BD0OBC_BC2_POSN                          equ 0002h
BD0OBC_BC2_POSITION                      equ 0002h
BD0OBC_BC2_SIZE                          equ 0001h
BD0OBC_BC2_LENGTH                        equ 0001h
BD0OBC_BC2_MASK                          equ 0004h
BD0OBC_BC3_POSN                          equ 0003h
BD0OBC_BC3_POSITION                      equ 0003h
BD0OBC_BC3_SIZE                          equ 0001h
BD0OBC_BC3_LENGTH                        equ 0001h
BD0OBC_BC3_MASK                          equ 0008h

// Register: BD0OAL
#define BD0OAL BD0OAL
BD0OAL                                   equ 01A2h

// Register: BD0IST
#define BD0IST BD0IST
BD0IST                                   equ 01A4h
// bitfield definitions
BD0IST_PID0_BSTALL_POSN                  equ 0002h
BD0IST_PID0_BSTALL_POSITION              equ 0002h
BD0IST_PID0_BSTALL_SIZE                  equ 0001h
BD0IST_PID0_BSTALL_LENGTH                equ 0001h
BD0IST_PID0_BSTALL_MASK                  equ 0004h
BD0IST_PID1_DTS_POSN                     equ 0003h
BD0IST_PID1_DTS_POSITION                 equ 0003h
BD0IST_PID1_DTS_SIZE                     equ 0001h
BD0IST_PID1_DTS_LENGTH                   equ 0001h
BD0IST_PID1_DTS_MASK                     equ 0008h
BD0IST_PID2_POSN                         equ 0004h
BD0IST_PID2_POSITION                     equ 0004h
BD0IST_PID2_SIZE                         equ 0001h
BD0IST_PID2_LENGTH                       equ 0001h
BD0IST_PID2_MASK                         equ 0010h
BD0IST_PID3_POSN                         equ 0005h
BD0IST_PID3_POSITION                     equ 0005h
BD0IST_PID3_SIZE                         equ 0001h
BD0IST_PID3_LENGTH                       equ 0001h
BD0IST_PID3_MASK                         equ 0020h
BD0IST_DATA0_1_POSN                      equ 0006h
BD0IST_DATA0_1_POSITION                  equ 0006h
BD0IST_DATA0_1_SIZE                      equ 0001h
BD0IST_DATA0_1_LENGTH                    equ 0001h
BD0IST_DATA0_1_MASK                      equ 0040h
BD0IST_UOWN_POSN                         equ 0007h
BD0IST_UOWN_POSITION                     equ 0007h
BD0IST_UOWN_SIZE                         equ 0001h
BD0IST_UOWN_LENGTH                       equ 0001h
BD0IST_UOWN_MASK                         equ 0080h
BD0IST_PID0_POSN                         equ 0002h
BD0IST_PID0_POSITION                     equ 0002h
BD0IST_PID0_SIZE                         equ 0001h
BD0IST_PID0_LENGTH                       equ 0001h
BD0IST_PID0_MASK                         equ 0004h
BD0IST_PID1_POSN                         equ 0003h
BD0IST_PID1_POSITION                     equ 0003h
BD0IST_PID1_SIZE                         equ 0001h
BD0IST_PID1_LENGTH                       equ 0001h
BD0IST_PID1_MASK                         equ 0008h
BD0IST_DATA01_POSN                       equ 0006h
BD0IST_DATA01_POSITION                   equ 0006h
BD0IST_DATA01_SIZE                       equ 0001h
BD0IST_DATA01_LENGTH                     equ 0001h
BD0IST_DATA01_MASK                       equ 0040h
BD0IST_OWN_POSN                          equ 0007h
BD0IST_OWN_POSITION                      equ 0007h
BD0IST_OWN_SIZE                          equ 0001h
BD0IST_OWN_LENGTH                        equ 0001h
BD0IST_OWN_MASK                          equ 0080h
BD0IST_BSTALL_POSN                       equ 0002h
BD0IST_BSTALL_POSITION                   equ 0002h
BD0IST_BSTALL_SIZE                       equ 0001h
BD0IST_BSTALL_LENGTH                     equ 0001h
BD0IST_BSTALL_MASK                       equ 0004h
BD0IST_DTS_POSN                          equ 0003h
BD0IST_DTS_POSITION                      equ 0003h
BD0IST_DTS_SIZE                          equ 0001h
BD0IST_DTS_LENGTH                        equ 0001h
BD0IST_DTS_MASK                          equ 0008h

// Register: BD0IBC
#define BD0IBC BD0IBC
BD0IBC                                   equ 01A5h
// bitfield definitions
BD0IBC_BC_POSN                           equ 0000h
BD0IBC_BC_POSITION                       equ 0000h
BD0IBC_BC_SIZE                           equ 0004h
BD0IBC_BC_LENGTH                         equ 0004h
BD0IBC_BC_MASK                           equ 000Fh
BD0IBC_BC0_POSN                          equ 0000h
BD0IBC_BC0_POSITION                      equ 0000h
BD0IBC_BC0_SIZE                          equ 0001h
BD0IBC_BC0_LENGTH                        equ 0001h
BD0IBC_BC0_MASK                          equ 0001h
BD0IBC_BC1_POSN                          equ 0001h
BD0IBC_BC1_POSITION                      equ 0001h
BD0IBC_BC1_SIZE                          equ 0001h
BD0IBC_BC1_LENGTH                        equ 0001h
BD0IBC_BC1_MASK                          equ 0002h
BD0IBC_BC2_POSN                          equ 0002h
BD0IBC_BC2_POSITION                      equ 0002h
BD0IBC_BC2_SIZE                          equ 0001h
BD0IBC_BC2_LENGTH                        equ 0001h
BD0IBC_BC2_MASK                          equ 0004h
BD0IBC_BC3_POSN                          equ 0003h
BD0IBC_BC3_POSITION                      equ 0003h
BD0IBC_BC3_SIZE                          equ 0001h
BD0IBC_BC3_LENGTH                        equ 0001h
BD0IBC_BC3_MASK                          equ 0008h

// Register: BD0IAL
#define BD0IAL BD0IAL
BD0IAL                                   equ 01A6h

// Register: BD1OST
#define BD1OST BD1OST
BD1OST                                   equ 01A8h
// bitfield definitions
BD1OST_PID0_BSTALL_POSN                  equ 0002h
BD1OST_PID0_BSTALL_POSITION              equ 0002h
BD1OST_PID0_BSTALL_SIZE                  equ 0001h
BD1OST_PID0_BSTALL_LENGTH                equ 0001h
BD1OST_PID0_BSTALL_MASK                  equ 0004h
BD1OST_PID1_DTS_POSN                     equ 0003h
BD1OST_PID1_DTS_POSITION                 equ 0003h
BD1OST_PID1_DTS_SIZE                     equ 0001h
BD1OST_PID1_DTS_LENGTH                   equ 0001h
BD1OST_PID1_DTS_MASK                     equ 0008h
BD1OST_PID2_POSN                         equ 0004h
BD1OST_PID2_POSITION                     equ 0004h
BD1OST_PID2_SIZE                         equ 0001h
BD1OST_PID2_LENGTH                       equ 0001h
BD1OST_PID2_MASK                         equ 0010h
BD1OST_PID3_POSN                         equ 0005h
BD1OST_PID3_POSITION                     equ 0005h
BD1OST_PID3_SIZE                         equ 0001h
BD1OST_PID3_LENGTH                       equ 0001h
BD1OST_PID3_MASK                         equ 0020h
BD1OST_DATA0_1_POSN                      equ 0006h
BD1OST_DATA0_1_POSITION                  equ 0006h
BD1OST_DATA0_1_SIZE                      equ 0001h
BD1OST_DATA0_1_LENGTH                    equ 0001h
BD1OST_DATA0_1_MASK                      equ 0040h
BD1OST_UOWN_POSN                         equ 0007h
BD1OST_UOWN_POSITION                     equ 0007h
BD1OST_UOWN_SIZE                         equ 0001h
BD1OST_UOWN_LENGTH                       equ 0001h
BD1OST_UOWN_MASK                         equ 0080h
BD1OST_PID0_POSN                         equ 0002h
BD1OST_PID0_POSITION                     equ 0002h
BD1OST_PID0_SIZE                         equ 0001h
BD1OST_PID0_LENGTH                       equ 0001h
BD1OST_PID0_MASK                         equ 0004h
BD1OST_PID1_POSN                         equ 0003h
BD1OST_PID1_POSITION                     equ 0003h
BD1OST_PID1_SIZE                         equ 0001h
BD1OST_PID1_LENGTH                       equ 0001h
BD1OST_PID1_MASK                         equ 0008h
BD1OST_DATA01_POSN                       equ 0006h
BD1OST_DATA01_POSITION                   equ 0006h
BD1OST_DATA01_SIZE                       equ 0001h
BD1OST_DATA01_LENGTH                     equ 0001h
BD1OST_DATA01_MASK                       equ 0040h
BD1OST_OWN_POSN                          equ 0007h
BD1OST_OWN_POSITION                      equ 0007h
BD1OST_OWN_SIZE                          equ 0001h
BD1OST_OWN_LENGTH                        equ 0001h
BD1OST_OWN_MASK                          equ 0080h
BD1OST_BSTALL_POSN                       equ 0002h
BD1OST_BSTALL_POSITION                   equ 0002h
BD1OST_BSTALL_SIZE                       equ 0001h
BD1OST_BSTALL_LENGTH                     equ 0001h
BD1OST_BSTALL_MASK                       equ 0004h
BD1OST_DTS_POSN                          equ 0003h
BD1OST_DTS_POSITION                      equ 0003h
BD1OST_DTS_SIZE                          equ 0001h
BD1OST_DTS_LENGTH                        equ 0001h
BD1OST_DTS_MASK                          equ 0008h

// Register: BD1OBC
#define BD1OBC BD1OBC
BD1OBC                                   equ 01A9h
// bitfield definitions
BD1OBC_BC_POSN                           equ 0000h
BD1OBC_BC_POSITION                       equ 0000h
BD1OBC_BC_SIZE                           equ 0004h
BD1OBC_BC_LENGTH                         equ 0004h
BD1OBC_BC_MASK                           equ 000Fh
BD1OBC_BC0_POSN                          equ 0000h
BD1OBC_BC0_POSITION                      equ 0000h
BD1OBC_BC0_SIZE                          equ 0001h
BD1OBC_BC0_LENGTH                        equ 0001h
BD1OBC_BC0_MASK                          equ 0001h
BD1OBC_BC1_POSN                          equ 0001h
BD1OBC_BC1_POSITION                      equ 0001h
BD1OBC_BC1_SIZE                          equ 0001h
BD1OBC_BC1_LENGTH                        equ 0001h
BD1OBC_BC1_MASK                          equ 0002h
BD1OBC_BC2_POSN                          equ 0002h
BD1OBC_BC2_POSITION                      equ 0002h
BD1OBC_BC2_SIZE                          equ 0001h
BD1OBC_BC2_LENGTH                        equ 0001h
BD1OBC_BC2_MASK                          equ 0004h
BD1OBC_BC3_POSN                          equ 0003h
BD1OBC_BC3_POSITION                      equ 0003h
BD1OBC_BC3_SIZE                          equ 0001h
BD1OBC_BC3_LENGTH                        equ 0001h
BD1OBC_BC3_MASK                          equ 0008h

