GopalSaraf/Practicals/PSDL/include/proc/pic16c765.inc
// Register: BD1OAL
#define BD1OAL BD1OAL
BD1OAL                                   equ 01AAh

// Register: BD1IST
#define BD1IST BD1IST
BD1IST                                   equ 01ACh
// bitfield definitions
BD1IST_PID0_BSTALL_POSN                  equ 0002h
BD1IST_PID0_BSTALL_POSITION              equ 0002h
BD1IST_PID0_BSTALL_SIZE                  equ 0001h
BD1IST_PID0_BSTALL_LENGTH                equ 0001h
BD1IST_PID0_BSTALL_MASK                  equ 0004h
BD1IST_PID1_DTS_POSN                     equ 0003h
BD1IST_PID1_DTS_POSITION                 equ 0003h
BD1IST_PID1_DTS_SIZE                     equ 0001h
BD1IST_PID1_DTS_LENGTH                   equ 0001h
BD1IST_PID1_DTS_MASK                     equ 0008h
BD1IST_PID2_POSN                         equ 0004h
BD1IST_PID2_POSITION                     equ 0004h
BD1IST_PID2_SIZE                         equ 0001h
BD1IST_PID2_LENGTH                       equ 0001h
BD1IST_PID2_MASK                         equ 0010h
BD1IST_PID3_POSN                         equ 0005h
BD1IST_PID3_POSITION                     equ 0005h
BD1IST_PID3_SIZE                         equ 0001h
BD1IST_PID3_LENGTH                       equ 0001h
BD1IST_PID3_MASK                         equ 0020h
BD1IST_DATA0_1_POSN                      equ 0006h
BD1IST_DATA0_1_POSITION                  equ 0006h
BD1IST_DATA0_1_SIZE                      equ 0001h
BD1IST_DATA0_1_LENGTH                    equ 0001h
BD1IST_DATA0_1_MASK                      equ 0040h
BD1IST_UOWN_POSN                         equ 0007h
BD1IST_UOWN_POSITION                     equ 0007h
BD1IST_UOWN_SIZE                         equ 0001h
BD1IST_UOWN_LENGTH                       equ 0001h
BD1IST_UOWN_MASK                         equ 0080h
BD1IST_PID0_POSN                         equ 0002h
BD1IST_PID0_POSITION                     equ 0002h
BD1IST_PID0_SIZE                         equ 0001h
BD1IST_PID0_LENGTH                       equ 0001h
BD1IST_PID0_MASK                         equ 0004h
BD1IST_PID1_POSN                         equ 0003h
BD1IST_PID1_POSITION                     equ 0003h
BD1IST_PID1_SIZE                         equ 0001h
BD1IST_PID1_LENGTH                       equ 0001h
BD1IST_PID1_MASK                         equ 0008h
BD1IST_DATA01_POSN                       equ 0006h
BD1IST_DATA01_POSITION                   equ 0006h
BD1IST_DATA01_SIZE                       equ 0001h
BD1IST_DATA01_LENGTH                     equ 0001h
BD1IST_DATA01_MASK                       equ 0040h
BD1IST_OWN_POSN                          equ 0007h
BD1IST_OWN_POSITION                      equ 0007h
BD1IST_OWN_SIZE                          equ 0001h
BD1IST_OWN_LENGTH                        equ 0001h
BD1IST_OWN_MASK                          equ 0080h
BD1IST_BSTALL_POSN                       equ 0002h
BD1IST_BSTALL_POSITION                   equ 0002h
BD1IST_BSTALL_SIZE                       equ 0001h
BD1IST_BSTALL_LENGTH                     equ 0001h
BD1IST_BSTALL_MASK                       equ 0004h
BD1IST_DTS_POSN                          equ 0003h
BD1IST_DTS_POSITION                      equ 0003h
BD1IST_DTS_SIZE                          equ 0001h
BD1IST_DTS_LENGTH                        equ 0001h
BD1IST_DTS_MASK                          equ 0008h

// Register: BD1IBC
#define BD1IBC BD1IBC
BD1IBC                                   equ 01ADh
// bitfield definitions
BD1IBC_BC_POSN                           equ 0000h
BD1IBC_BC_POSITION                       equ 0000h
BD1IBC_BC_SIZE                           equ 0004h
BD1IBC_BC_LENGTH                         equ 0004h
BD1IBC_BC_MASK                           equ 000Fh
BD1IBC_BC0_POSN                          equ 0000h
BD1IBC_BC0_POSITION                      equ 0000h
BD1IBC_BC0_SIZE                          equ 0001h
BD1IBC_BC0_LENGTH                        equ 0001h
BD1IBC_BC0_MASK                          equ 0001h
BD1IBC_BC1_POSN                          equ 0001h
BD1IBC_BC1_POSITION                      equ 0001h
BD1IBC_BC1_SIZE                          equ 0001h
BD1IBC_BC1_LENGTH                        equ 0001h
BD1IBC_BC1_MASK                          equ 0002h
BD1IBC_BC2_POSN                          equ 0002h
BD1IBC_BC2_POSITION                      equ 0002h
BD1IBC_BC2_SIZE                          equ 0001h
BD1IBC_BC2_LENGTH                        equ 0001h
BD1IBC_BC2_MASK                          equ 0004h
BD1IBC_BC3_POSN                          equ 0003h
BD1IBC_BC3_POSITION                      equ 0003h
BD1IBC_BC3_SIZE                          equ 0001h
BD1IBC_BC3_LENGTH                        equ 0001h
BD1IBC_BC3_MASK                          equ 0008h

// Register: BD1IAL
#define BD1IAL BD1IAL
BD1IAL                                   equ 01AEh

// Register: BD2OST
#define BD2OST BD2OST
BD2OST                                   equ 01B0h
// bitfield definitions
BD2OST_PID0_BSTALL_POSN                  equ 0002h
BD2OST_PID0_BSTALL_POSITION              equ 0002h
BD2OST_PID0_BSTALL_SIZE                  equ 0001h
BD2OST_PID0_BSTALL_LENGTH                equ 0001h
BD2OST_PID0_BSTALL_MASK                  equ 0004h
BD2OST_PID1_DTS_POSN                     equ 0003h
BD2OST_PID1_DTS_POSITION                 equ 0003h
BD2OST_PID1_DTS_SIZE                     equ 0001h
BD2OST_PID1_DTS_LENGTH                   equ 0001h
BD2OST_PID1_DTS_MASK                     equ 0008h
BD2OST_PID2_POSN                         equ 0004h
BD2OST_PID2_POSITION                     equ 0004h
BD2OST_PID2_SIZE                         equ 0001h
BD2OST_PID2_LENGTH                       equ 0001h
BD2OST_PID2_MASK                         equ 0010h
BD2OST_PID3_POSN                         equ 0005h
BD2OST_PID3_POSITION                     equ 0005h
BD2OST_PID3_SIZE                         equ 0001h
BD2OST_PID3_LENGTH                       equ 0001h
BD2OST_PID3_MASK                         equ 0020h
BD2OST_DATA0_1_POSN                      equ 0006h
BD2OST_DATA0_1_POSITION                  equ 0006h
BD2OST_DATA0_1_SIZE                      equ 0001h
BD2OST_DATA0_1_LENGTH                    equ 0001h
BD2OST_DATA0_1_MASK                      equ 0040h
BD2OST_UOWN_POSN                         equ 0007h
BD2OST_UOWN_POSITION                     equ 0007h
BD2OST_UOWN_SIZE                         equ 0001h
BD2OST_UOWN_LENGTH                       equ 0001h
BD2OST_UOWN_MASK                         equ 0080h
BD2OST_PID0_POSN                         equ 0002h
BD2OST_PID0_POSITION                     equ 0002h
BD2OST_PID0_SIZE                         equ 0001h
BD2OST_PID0_LENGTH                       equ 0001h
BD2OST_PID0_MASK                         equ 0004h
BD2OST_PID1_POSN                         equ 0003h
BD2OST_PID1_POSITION                     equ 0003h
BD2OST_PID1_SIZE                         equ 0001h
BD2OST_PID1_LENGTH                       equ 0001h
BD2OST_PID1_MASK                         equ 0008h
BD2OST_DATA01_POSN                       equ 0006h
BD2OST_DATA01_POSITION                   equ 0006h
BD2OST_DATA01_SIZE                       equ 0001h
BD2OST_DATA01_LENGTH                     equ 0001h
BD2OST_DATA01_MASK                       equ 0040h
BD2OST_OWN_POSN                          equ 0007h
BD2OST_OWN_POSITION                      equ 0007h
BD2OST_OWN_SIZE                          equ 0001h
BD2OST_OWN_LENGTH                        equ 0001h
BD2OST_OWN_MASK                          equ 0080h
BD2OST_BSTALL_POSN                       equ 0002h
BD2OST_BSTALL_POSITION                   equ 0002h
BD2OST_BSTALL_SIZE                       equ 0001h
BD2OST_BSTALL_LENGTH                     equ 0001h
BD2OST_BSTALL_MASK                       equ 0004h
BD2OST_DTS_POSN                          equ 0003h
BD2OST_DTS_POSITION                      equ 0003h
BD2OST_DTS_SIZE                          equ 0001h
BD2OST_DTS_LENGTH                        equ 0001h
BD2OST_DTS_MASK                          equ 0008h

