GopalSaraf/Practicals/PSDL/include/proc/pic16c765.inc
// Register: BD2OBC
#define BD2OBC BD2OBC
BD2OBC                                   equ 01B1h
// bitfield definitions
BD2OBC_BC_POSN                           equ 0000h
BD2OBC_BC_POSITION                       equ 0000h
BD2OBC_BC_SIZE                           equ 0004h
BD2OBC_BC_LENGTH                         equ 0004h
BD2OBC_BC_MASK                           equ 000Fh
BD2OBC_BC0_POSN                          equ 0000h
BD2OBC_BC0_POSITION                      equ 0000h
BD2OBC_BC0_SIZE                          equ 0001h
BD2OBC_BC0_LENGTH                        equ 0001h
BD2OBC_BC0_MASK                          equ 0001h
BD2OBC_BC1_POSN                          equ 0001h
BD2OBC_BC1_POSITION                      equ 0001h
BD2OBC_BC1_SIZE                          equ 0001h
BD2OBC_BC1_LENGTH                        equ 0001h
BD2OBC_BC1_MASK                          equ 0002h
BD2OBC_BC2_POSN                          equ 0002h
BD2OBC_BC2_POSITION                      equ 0002h
BD2OBC_BC2_SIZE                          equ 0001h
BD2OBC_BC2_LENGTH                        equ 0001h
BD2OBC_BC2_MASK                          equ 0004h
BD2OBC_BC3_POSN                          equ 0003h
BD2OBC_BC3_POSITION                      equ 0003h
BD2OBC_BC3_SIZE                          equ 0001h
BD2OBC_BC3_LENGTH                        equ 0001h
BD2OBC_BC3_MASK                          equ 0008h

// Register: BD2OAL
#define BD2OAL BD2OAL
BD2OAL                                   equ 01B2h

// Register: BD2IST
#define BD2IST BD2IST
BD2IST                                   equ 01B4h
// bitfield definitions
BD2IST_PID0_BSTALL_POSN                  equ 0002h
BD2IST_PID0_BSTALL_POSITION              equ 0002h
BD2IST_PID0_BSTALL_SIZE                  equ 0001h
BD2IST_PID0_BSTALL_LENGTH                equ 0001h
BD2IST_PID0_BSTALL_MASK                  equ 0004h
BD2IST_PID1_DTS_POSN                     equ 0003h
BD2IST_PID1_DTS_POSITION                 equ 0003h
BD2IST_PID1_DTS_SIZE                     equ 0001h
BD2IST_PID1_DTS_LENGTH                   equ 0001h
BD2IST_PID1_DTS_MASK                     equ 0008h
BD2IST_PID2_POSN                         equ 0004h
BD2IST_PID2_POSITION                     equ 0004h
BD2IST_PID2_SIZE                         equ 0001h
BD2IST_PID2_LENGTH                       equ 0001h
BD2IST_PID2_MASK                         equ 0010h
BD2IST_PID3_POSN                         equ 0005h
BD2IST_PID3_POSITION                     equ 0005h
BD2IST_PID3_SIZE                         equ 0001h
BD2IST_PID3_LENGTH                       equ 0001h
BD2IST_PID3_MASK                         equ 0020h
BD2IST_DATA0_1_POSN                      equ 0006h
BD2IST_DATA0_1_POSITION                  equ 0006h
BD2IST_DATA0_1_SIZE                      equ 0001h
BD2IST_DATA0_1_LENGTH                    equ 0001h
BD2IST_DATA0_1_MASK                      equ 0040h
BD2IST_UOWN_POSN                         equ 0007h
BD2IST_UOWN_POSITION                     equ 0007h
BD2IST_UOWN_SIZE                         equ 0001h
BD2IST_UOWN_LENGTH                       equ 0001h
BD2IST_UOWN_MASK                         equ 0080h
BD2IST_PID0_POSN                         equ 0002h
BD2IST_PID0_POSITION                     equ 0002h
BD2IST_PID0_SIZE                         equ 0001h
BD2IST_PID0_LENGTH                       equ 0001h
BD2IST_PID0_MASK                         equ 0004h
BD2IST_PID1_POSN                         equ 0003h
BD2IST_PID1_POSITION                     equ 0003h
BD2IST_PID1_SIZE                         equ 0001h
BD2IST_PID1_LENGTH                       equ 0001h
BD2IST_PID1_MASK                         equ 0008h
BD2IST_DATA01_POSN                       equ 0006h
BD2IST_DATA01_POSITION                   equ 0006h
BD2IST_DATA01_SIZE                       equ 0001h
BD2IST_DATA01_LENGTH                     equ 0001h
BD2IST_DATA01_MASK                       equ 0040h
BD2IST_OWN_POSN                          equ 0007h
BD2IST_OWN_POSITION                      equ 0007h
BD2IST_OWN_SIZE                          equ 0001h
BD2IST_OWN_LENGTH                        equ 0001h
BD2IST_OWN_MASK                          equ 0080h
BD2IST_BSTALL_POSN                       equ 0002h
BD2IST_BSTALL_POSITION                   equ 0002h
BD2IST_BSTALL_SIZE                       equ 0001h
BD2IST_BSTALL_LENGTH                     equ 0001h
BD2IST_BSTALL_MASK                       equ 0004h
BD2IST_DTS_POSN                          equ 0003h
BD2IST_DTS_POSITION                      equ 0003h
BD2IST_DTS_SIZE                          equ 0001h
BD2IST_DTS_LENGTH                        equ 0001h
BD2IST_DTS_MASK                          equ 0008h

// Register: BD2IBC
#define BD2IBC BD2IBC
BD2IBC                                   equ 01B5h
// bitfield definitions
BD2IBC_BC_POSN                           equ 0000h
BD2IBC_BC_POSITION                       equ 0000h
BD2IBC_BC_SIZE                           equ 0004h
BD2IBC_BC_LENGTH                         equ 0004h
BD2IBC_BC_MASK                           equ 000Fh
BD2IBC_BC0_POSN                          equ 0000h
BD2IBC_BC0_POSITION                      equ 0000h
BD2IBC_BC0_SIZE                          equ 0001h
BD2IBC_BC0_LENGTH                        equ 0001h
BD2IBC_BC0_MASK                          equ 0001h
BD2IBC_BC1_POSN                          equ 0001h
BD2IBC_BC1_POSITION                      equ 0001h
BD2IBC_BC1_SIZE                          equ 0001h
BD2IBC_BC1_LENGTH                        equ 0001h
BD2IBC_BC1_MASK                          equ 0002h
BD2IBC_BC2_POSN                          equ 0002h
BD2IBC_BC2_POSITION                      equ 0002h
BD2IBC_BC2_SIZE                          equ 0001h
BD2IBC_BC2_LENGTH                        equ 0001h
BD2IBC_BC2_MASK                          equ 0004h
BD2IBC_BC3_POSN                          equ 0003h
BD2IBC_BC3_POSITION                      equ 0003h
BD2IBC_BC3_SIZE                          equ 0001h
BD2IBC_BC3_LENGTH                        equ 0001h
BD2IBC_BC3_MASK                          equ 0008h

